from fastapi import FastAPI

app = FastAPI()


@app.get("/home/{Reshteh}")
def search(Reshteh):
    Names = ["گرایش عمومی", "حقوق بین الملل", "حقوق بشر", "حقوق خانواده", "حقوق اقتصادی", "حقوق خصوصی",
            "حقوق جزا و جرم شناسی"]
    if Reshteh not  in Names:
        return "شما در دانشکده حقوق تحصیل می کنید!"
    M = ["مهندسی برق", "متالوروژی", " مهندسی کامپیوتر", 'مهندسی مکانیک', "مهندسی عمران", "مهندسی معدن",
         "شیمی کاربردی", "الکترونیک", "شیمی محض", "مهندسی صنایع"]
    if Reshteh  not in M:
        return "شما در دانشکده فنی و مهندسی تحصیل می کنید!"
    return "نام دانشکده درست است "
